# [2020 신입 데이터 분석가 채용 : basic coding test]

## 1. basic list processing

In [1]:
import numpy as np

In [20]:
import numpy as np

list1 = [1,2,3]
list2 = [1,2,3,4,5,6]

# list3의 값이 [1,2,3,1,2,3]이 되도록 list1을 이용하여 code를 작성하세요
list3 = list1 + list1
display(list3)

# list4의 값이 [1, 2, 3, 1, 2, 3, 1, 2, 3, 4, 5, 6] 가 되도록 list3과 list2를 이용하여 code를 작성하세요
list4 = list3 + list2
display(list4)

# list5의 값이 [2, 4, 6, 5, 7, 9]가 되도록 list3과 list2를 이용하여 code를 작성하세요. 두 list의 원소들끼리의 더하기 결과
list5 = []
for a1, a2 in zip(list2, list3):
    list5.append(a1 + a2)
display(list5)

[1, 2, 3, 1, 2, 3]

[1, 2, 3, 1, 2, 3, 1, 2, 3, 4, 5, 6]

[2, 4, 6, 5, 7, 9]

## 2. list comprehension

In [58]:
# list comprehension을 이용하여 list1으로부터 list2와 list3를 만드는 code를 작성하세요.

list1 = [0,1,2,3,4,5,6,7,8,9]

# list2 = # [0, 2, 4, 6, 8, 10, 12, 14, 16, 18] 
list2 = [i*2 for i in list1]
display(list2)

# list3 = # [0, 2, 4, 6, 8] 
list3 = [i for i in list1 if i%2 ==0]
display(list3)

[0, 2, 4, 6, 8, 10, 12, 14, 16, 18]

[0, 2, 4, 6, 8]

## 3. set operation

In [61]:
# list1의 원소들중에서 list2의 원소가 아닌것들만 모아서 list3을 만들고자 한다. 즉, list3 : [0, 2, 4, 6, 8]
# code를 작성하세요

list1 = [0,1,2,3,4,5,6,7,8,9]
list2 = [1,3,5,7,9,11,13,15,17,19]

list3 = []
for i in set(list1):
    if i not in set(list2):
        list3.append(i)
display(list3)

[0, 2, 4, 6, 8]

## 4. dataframe parameter

In [37]:
## col2가 홀수면 col1은 'o', 짝수면 'e'로 변경하고자 한다.
## 주어진 code를 실행해 보고 표시되는 warning/error message의 의미를 설명하고 message의 지시대로 code를 수정하세요

import pandas as pd 

def process_df(df_param):
    
    ## loc 인덱서를 사용하시요.
    df_param.loc[df_param.col2 % 2 == 0,'col1'] = 'e'
    df_param.loc[df_param.col2 % 2 == 1,'col1'] = 'o'

def main():
    df = pd.DataFrame(
        [
            {'col1':'?', 'col2':1},
            {'col1':'?', 'col2':2},
            {'col1':'?', 'col2':3},
            {'col1':'?', 'col2':4},
        ]
    )
    
    display(df)
    process_df(df)
    display(df)
    
main()

  col1  col2
0    ?     1
1    ?     2
2    ?     3
3    ?     4

  col1  col2
0    o     1
1    e     2
2    o     3
3    e     4

## 5. diff between rows

In [42]:
# 주어진 df의 col2를 이용하여 col2_diff를 만드는 code를 작성하세요.
# col2_diff는 col2의 앞 원소에서 뒷 원소를 뺀 값. 단 제일 첫번째 값은 0으로 채우세요.
# 4-0 = 4, 0-7 = -7, 7-2 = 5, ... 
# 즉, col2_diff = [0.0, 4.0, -7.0, 5.0, -6.0, 7.0, -1.0, -3.0, 2.0, -6.0]

import pandas as pd
val2 = [4,0,7,2,8,1,2,5,3,9]
val1 = [chr(i) for i in range(ord('a'), ord('z')+1)][:len(val2)]

df = pd.DataFrame({'col1':val1, 'col2':val2})
display(df)

df['col2_diff'] = df['col2'].shift(1)
df['col2_diff'] = df['col2_diff'] - df['col2']
df['col2_diff'] = df['col2_diff'].fillna(0)
display(df)

  col1  col2
0    a     4
1    b     0
2    c     7
3    d     2
4    e     8
5    f     1
6    g     2
7    h     5
8    i     3
9    j     9

  col1  col2  col2_diff
0    a     4        0.0
1    b     0        4.0
2    c     7       -7.0
3    d     2        5.0
4    e     8       -6.0
5    f     1        7.0
6    g     2       -1.0
7    h     5       -3.0
8    i     3        2.0
9    j     9       -6.0

## 6. vectorized str function of pandas series & type cast

In [ ]:
# code columns (string)의 'code_' 부분을 없애고 나머지 부분을 integer로 type을 변경하여 각 integer code 값을 두배 (x 2)하는 code를 작성하세요.
# 즉, 결과를 다음과 같이 만들도록

'''
[{'code': 246, 'name': 'abc'},
 {'code': 690, 'name': 'xyz'},
 {'code': 1356, 'name': 'stw'}]
'''

df = pd.DataFrame([
    {'code':'code_123', 'name':'abc'},
    {'code':'code_345', 'name':'xyz'},    
    {'code':'code_678', 'name':'stw'},    
])

display(df)

# ...
# ... 
# ...

display(df)

       code name
0  code_123  abc
1  code_345  xyz
2  code_678  stw

       code name
0  code_123  abc
1  code_345  xyz
2  code_678  stw

## 7. basic datetime, timedelta and parsing/formatting datetime

In [52]:
from datetime import datetime, timedelta

str_datetime1 = '2019-02-26 14:35:50'
display(str_datetime1)

# string으로 표현된 시간 str_datetime1을 datetime으로 만듭니다. 
dt1 = pd.to_datetime(str_datetime1)
display(dt1)

# dt1으로부터 72시간 45분전 datetime을 구합니다.
dt2 = dt1 - datetime.datetime(hour=72) - datetime.datetime(minunes=45)
display(dt2)

# dt2를 str_datetime1와 같은 형식의 string으로 변환하여 출력합니다.
# display( ... )

## 8. group by multiple columns & apply

In [ ]:
# id, sub_id 의 두개 columns으로 group by 하여 val1의 합을 'sum_val1' column , val2의 곱을 'prod_val2' columns으로 하는 dataframe을 만드는 code를 작성하세요.
# hint : series의 합 : .sum(), 곱 : .prod()
# groupby와 apply 사용. lambda를 사용해도 되고 apply function을 define하여 사용해도 됨.

# 참조 : 결과는 아래와 같이 나옵니다.
'''
[{'id': 'a', 'sub_id': 1, 'sum_val1': 100, 'prod_val2': 10},
 {'id': 'a', 'sub_id': 2, 'sum_val1': 102, 'prod_val2': 22},
 {'id': 'a', 'sub_id': 3, 'sum_val1': 104, 'prod_val2': 36},
 {'id': 'b', 'sub_id': 1, 'sum_val1': 106, 'prod_val2': 52},
 {'id': 'b', 'sub_id': 2, 'sum_val1': 108, 'prod_val2': 70},
 {'id': 'b', 'sub_id': 3, 'sum_val1': 110, 'prod_val2': 90},
 {'id': 'c', 'sub_id': 1, 'sum_val1': 112, 'prod_val2': 112},
 {'id': 'c', 'sub_id': 2, 'sum_val1': 114, 'prod_val2': 136},
 {'id': 'c', 'sub_id': 3, 'sum_val1': 116, 'prod_val2': 162}]
'''

import numpy as np

df = pd.DataFrame([
    {'id':'a', 'sub_id':1, 'val1':0, 'val2':10},
    {'id':'a', 'sub_id':1, 'val1':100, 'val2':1},
    
    {'id':'a', 'sub_id':2, 'val1':1, 'val2':11},
    {'id':'a', 'sub_id':2, 'val1':101, 'val2':2},
    
    {'id':'a', 'sub_id':3, 'val1':2, 'val2':12},
    {'id':'a', 'sub_id':3, 'val1':102, 'val2':3},
    
    {'id':'b', 'sub_id':1, 'val1':3, 'val2':13},
    {'id':'b', 'sub_id':1, 'val1':103, 'val2':4},
    
    {'id':'b', 'sub_id':2, 'val1':4, 'val2':14},
    {'id':'b', 'sub_id':2, 'val1':104, 'val2':5},
    
    {'id':'b', 'sub_id':3, 'val1':5, 'val2':15},
    {'id':'b', 'sub_id':3, 'val1':105, 'val2':6},
    
    {'id':'c', 'sub_id':1, 'val1':6, 'val2':16},
    {'id':'c', 'sub_id':1, 'val1':106, 'val2':7},
    
    {'id':'c', 'sub_id':2, 'val1':7, 'val2':17},
    {'id':'c', 'sub_id':2, 'val1':107, 'val2':8},
    
    {'id':'c', 'sub_id':3, 'val1':8, 'val2':18},
    {'id':'c', 'sub_id':3, 'val1':108, 'val2':9},
])

# df_result =  ... 
# display(df_result)

## 9. parallel processing

In [ ]:
# multi processing을 이용하여 1 ~ 100까지의 factorial의 합을 구하는 code를 작성하세요.
# factorial(1) + factorial(2) + ... + factorial(100)
# 주의 : windows notebook 환경에서는 multi-processing이 원활하지 않습니다.
# .py script를 작성하여 command shell 에서 python xxx.py로 실행되도록 작성합니다.

## 10. SQL basics

In [ ]:
# RDB에 연결되었다고 가정하고, 주어진 문제에 맞도록 query의 [...] 부분을 완성하세요.
import pandas as pd
from sqlalchemy import create_engine
import pymysql
# pymysql.install_as_MySQLdb()
# rdb = 'mysql://user:password@host:port/wspider_rev?charset=utf8mb4' 
# engine = create_engine(rdb, encoding='utf8', pool_size=50, pool_recycle=3600, connect_args={'connect_timeout':1000000})

In [ ]:
# Q1 - table MWS_COLT_ITEM의 전체 columns을 10개 row만 읽어오는 sql query는 ? hint : limit 
query = 'select * from MWS_COLT_ITEM LIMIT 10;'
result = pd.read_sql_query(query, engine)    
display(result)

# Q2 - table MWS_COLT_ITEM의 BRAND_NAME columns의 unique한 값의 갯수는 몇 개인지를 읽어오는 query ? hint : count distinct
query = 'select DISTINCT BRAND_NAME from MWS_COLT_ITEM;'
result = pd.read_sql_query(query, engine)    
display(result)

# Q3 - table MWS_COLT_ITEM_IVT에서 ITEM_ID = 100 인 rows들의 unique한 STOCK_ID 들만 표시하는 query ? hint : distinct where
query = 'select DISTINCT STOCK_ID from MWS_COLT_ITEM_IVT WHERE ITEM_ID = 100;'
result = pd.read_sql_query(query, engine)    
display(result)

# Q4 - table MWS_COLT_ITEM_IVT에서 ITEM_ID = 100 이고 REG_DT가 "2019-01-25" 일 0시부터 "2019-01-26"일 0시 까지의 rows들을 읽는 query ? hint : between
query = 'select * from MWS_COLT_ITEM_IVT where ITEM_ID =100 BETWEEN "2019-01-25" AND "2019-01-26" ;'
result = pd.read_sql_query(query, engine)    
display(result)

# Q5 -  MWS_COLT_ITEM table에서 BRAND_NAME이 "CASIO"인 제품중 ID columns이 MWS_COLT_ITEM_IVT table의 ITEM_ID columns의 값과 같은 rows들의  
#       ITEM_ID, STOCK_ID, GOODS_NAME, BRAND_NAME, REG_DT (MWS_COLT_ITEM_IVT의 REG DT), STOCK_AMOUNT columns만을 읽어오는 query ? 
query = 'select [...] from MWS_COLT_ITEM_IVT IVT JOIN MWS_COLT_ITEM ITEM ON [...] where [...];'
result = pd.read_sql_query(query, engine)    
display(result)

engine.dispose()